# Jupyter notebook 실습

In [2]:
print('abc')

abc

In [8]:
list1=[]
for i in range(10):
    list1.append(i)
print(list1)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [11]:
list1=[i*10 for i in range(10)]
print(list1)

[0, 10, 20, 30, 40, 50, 60, 70, 80, 90]

In [23]:
print(list1[5])
print(list1[:3])
print(list1[1:3])
list1[-3:]

50
[0, 10, 20]
[10, 20]

[70, 80, 90]

In [26]:
list2=[]
for i in range(10):
    if i%2:
        list2.append(i*2)    
    else:
        list2.append(i*100)    
print(list2)

0 0
1 1
2 0
3 1
4 0
5 1
6 0
7 1
8 0
9 1
[0, 2, 200, 6, 400, 10, 600, 14, 800, 18]

In [27]:
list2=[i*2 if i%2 else i*100 for i in range(10)]
print(list2)
for i in list2:
    print(i)

[0, 2, 200, 6, 400, 10, 600, 14, 800, 18]
0
2
200
6
400
10
600
14
800
18

In [28]:
dict = {'Name': 'Zara', 'Age': 7, 'Class': 'First'}
print(dict)
dict['abc']=[1,2,3]
print(dict)
for key, value in dict.items():
    print(key, " :: ", value)

{'Name': 'Zara', 'Age': 7, 'Class': 'First'}
{'Name': 'Zara', 'Age': 7, 'Class': 'First', 'abc': [1, 2, 3]}
Name  ::  Zara
Age  ::  7
Class  ::  First
abc  ::  [1, 2, 3]

In [29]:
import pandas as pd
df = pd.read_json('http://aopt.biz/lecture/cars.json')

In [30]:
df.head()

,Acceleration,Cylinders,Displacement,Horsepower,Miles_per_Gallon,Name,Origin,Weight_in_lbs,Year
0,12.0,8,307.0,130.0,18.0,chevrolet chevelle malibu,USA,3504,1970
1,11.5,8,350.0,165.0,15.0,buick skylark 320,USA,3693,1970
2,11.0,8,318.0,150.0,18.0,plymouth satellite,USA,3436,1970
3,12.0,8,304.0,150.0,16.0,amc rebel sst,USA,3433,1970
4,10.5,8,302.0,140.0,17.0,ford torino,USA,3449,1970

In [31]:
df.tail()

,Acceleration,Cylinders,Displacement,Horsepower,Miles_per_Gallon,Name,Origin,Weight_in_lbs,Year
401,15.6,4,140.0,86.0,27.0,ford mustang gl,USA,2790,1982
402,24.6,4,97.0,52.0,44.0,vw pickup,Europe,2130,1982
403,11.6,4,135.0,84.0,32.0,dodge rampage,USA,2295,1982
404,18.6,4,120.0,79.0,28.0,ford ranger,USA,2625,1982
405,19.4,4,119.0,82.0,31.0,chevy s-10,USA,2720,1982

In [32]:
#df.loc[0]
#df.loc[2:4]   
df.iloc[2:4,0:2]
#df.iloc[-3:]

   Acceleration  Cylinders
2          11.0          8
3          12.0          8

In [33]:
df.describe()

,Acceleration,Cylinders,Displacement,Horsepower,Miles_per_Gallon,Weight_in_lbs,Year
count,406.000000,406.000000,406.000000,400.000000,398.000000,406.000000,406.000000
mean,15.519704,5.475369,194.779557,105.082500,23.514573,2979.413793,1975.995074
std,2.803359,1.712160,104.922458,38.768779,7.815984,847.004328,3.856689
min,8.000000,3.000000,68.000000,46.000000,9.000000,1613.000000,1970.000000
25%,13.700000,4.000000,105.000000,75.750000,17.500000,2226.500000,1973.000000
50%,15.500000,4.000000,151.000000,95.000000,23.000000,2822.500000,1976.000000
75%,17.175000,8.000000,302.000000,130.000000,29.000000,3618.250000,1979.000000
max,24.800000,8.000000,455.000000,230.000000,46.600000,5140.000000,1982.000000

In [34]:
df.shape

(406, 9)

In [35]:
df.dtypes

Acceleration        float64
Cylinders             int64
Displacement        float64
Horsepower          float64
Miles_per_Gallon    float64
Name                 object
Origin               object
Weight_in_lbs         int64
Year                  int64
dtype: object

In [36]:
df.isnull().sum()

Acceleration        0
Cylinders           0
Displacement        0
Horsepower          6
Miles_per_Gallon    8
Name                0
Origin              0
Weight_in_lbs       0
Year                0
dtype: int64

In [ ]:
df.head()

In [ ]:
df.tail()

In [37]:
df[:10]

,Acceleration,Cylinders,Displacement,Horsepower,Miles_per_Gallon,Name,Origin,Weight_in_lbs,Year
0,12.0,8,307.0,130.0,18.0,chevrolet chevelle malibu,USA,3504,1970
1,11.5,8,350.0,165.0,15.0,buick skylark 320,USA,3693,1970
2,11.0,8,318.0,150.0,18.0,plymouth satellite,USA,3436,1970
3,12.0,8,304.0,150.0,16.0,amc rebel sst,USA,3433,1970
4,10.5,8,302.0,140.0,17.0,ford torino,USA,3449,1970
5,10.0,8,429.0,198.0,15.0,ford galaxie 500,USA,4341,1970
6,9.0,8,454.0,220.0,14.0,chevrolet impala,USA,4354,1970
7,8.5,8,440.0,215.0,14.0,plymouth fury iii,USA,4312,1970
8,10.0,8,455.0,225.0,14.0,pontiac catalina,USA,4425,1970
9,8.5,8,390.0,190.0,15.0,amc ambassador dpl,USA,3850,1970